# AddReferencePlane Method (Plane, DirectShapeReferenceOptions) (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
DirectShapeType..::..AddReferencePlane Method (Plane, DirectShapeReferenceOptions)
DirectShapeType Class See Also
---
Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void AddReferencePlane(
	Plane refPlane,
	DirectShapeReferenceOptions options
)
```

Visual Basic
---
```text
Public Sub AddReferencePlane ( _
	refPlane As Plane, _
	options As DirectShapeReferenceOptions _
)
```

Visual C++
---
```text
public:
void AddReferencePlane(
	Plane^ refPlane,
	DirectShapeReferenceOptions^ options
)
```

# ### Parameters
refPlane
    Type: Autodesk.Revit.DB..::..Plane The geometry of the new reference plane.
options
    Type: Autodesk.Revit.DB..::..DirectShapeReferenceOptions The options that are used to configure the new reference plane.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeType Class
AddReferencePlane Overload
Autodesk.Revit.DB Namespace